Revit 2027 API
RebarInSystem.GetMovedBarTransform Method
 Returns a transform representing the movement of the bar relative to its default position along the distribution path.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetMovedBarTransform(
	int barPositionIndex
)
Public Function GetMovedBarTransform (
	barPositionIndex As Integer
) As Transform
public:
Transform^ GetMovedBarTransform(
	int barPositionIndex
)
member GetMovedBarTransform :
        barPositionIndex : int -> Transform
Parameters
barPositionIndex Int32
 The bar index.
Return Value
Transform
 The transform representing the movement of the bar relative to its default position along the distribution path.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Remarks
 For a RebarInSystem for which individual bars can't be edited (the ones owned by AreaReinforcement) the identity transform is returned.
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace